Repository: khater314/ShippingSystem
Catalog: AppResources.Localization/Resources/ResValidation.*.resx
Languages: ar

# Req_Field
source: {0} is required
ar: {0} مطلوب

# Req_Simple
source: This field is required
ar: هذا الحقل مطلوب

# Req_Select
source: Please select a {0}
ar: يرجى اختيار {0}

# Req_Check
source: You must check this box to continue
ar: يجب تحديد هذا المربع للمتابعة

# Req_Agree
source: You must agree to the terms and conditions
ar: يجب الموافقة على الشروط والأحكام

# Req_Upload
source: Please upload a {0}
ar: يرجى رفع {0}

# Format_Email
source: Please enter a valid email address
ar: يرجى إدخال بريد إلكتروني صالح

# Format_EmailWithField
source: {0} must be a valid email address
ar: {0} يجب أن يكون بريداً إلكترونياً صالحاً

# Format_Phone
source: Please enter a valid phone number
ar: يرجى إدخال رقم هاتف صالح

# Format_PhoneWithField
source: {0} must be a valid phone number
ar: {0} يجب أن يكون رقم هاتف صالحاً

# Format_Mobile
source: Please enter a valid mobile number
ar: يرجى إدخال رقم جوال صالح

# Format_Url
source: Please enter a valid URL
ar: يرجى إدخال رابط صالح

# Format_UrlWithField
source: {0} must be a valid URL
ar: {0} يجب أن يكون رابطاً صالحاً

# Format_Number
source: Please enter a valid number
ar: يرجى إدخال رقم صالح

# Format_NumberWithField
source: {0} must be a valid number
ar: {0} يجب أن يكون رقماً صالحاً

# Format_Integer
source: Please enter a whole number
ar: يرجى إدخال رقم صحيح

# Format_IntegerWithField
source: {0} must be a whole number
ar: {0} يجب أن يكون رقماً صحيحاً

# Format_Decimal
source: Please enter a valid decimal number
ar: يرجى إدخال رقم عشري صالح

# Format_DecimalWithField
source: {0} must be a valid decimal number
ar: {0} يجب أن يكون رقماً عشرياً صالحاً

# Format_Date
source: Please enter a valid date
ar: يرجى إدخال تاريخ صالح

# Format_DateWithField
source: {0} must be a valid date
ar: {0} يجب أن يكون تاريخاً صالحاً

# Format_Time
source: Please enter a valid time
ar: يرجى إدخال وقت صالح

# Format_TimeWithField
source: {0} must be a valid time
ar: {0} يجب أن يكون وقتاً صالحاً

# Format_DateTime
source: Please enter a valid date and time
ar: يرجى إدخال تاريخ ووقت صالحين

# Format_DateTimeWithField
source: {0} must be a valid date and time
ar: {0} يجب أن يكون تاريخاً ووقتاً صالحين

# Format_CreditCard
source: Please enter a valid credit card number
ar: يرجى إدخال رقم بطاقة ائتمان صالح

# Format_CreditCardWithField
source: {0} must be a valid credit card number
ar: {0} يجب أن يكون رقم بطاقة ائتمان صالحاً

# Format_PostalCode
source: Please enter a valid postal code
ar: يرجى إدخال رمز بريدي صالح

# Format_PostalCodeWithField
source: {0} must be a valid postal code
ar: {0} يجب أن يكون رمزاً بريدياً صالحاً

# Format_IPAddress
source: Please enter a valid IP address
ar: يرجى إدخال عنوان IP صالح

# Format_HexColor
source: Please enter a valid hex color code (e.g., #FF0000)
ar: يرجى إدخال رمز لون سداسي عشري صالح (مثل: #FF0000)

# Format_AlphaNumeric
source: Only letters and numbers are allowed
ar: يُسمح فقط بالحروف والأرقام

# Format_AlphaNumericWithField
source: {0} can only contain letters and numbers
ar: {0} يمكن أن يحتوي على حروف وأرقام فقط

# Format_LettersOnly
source: Only letters are allowed
ar: يُسمح فقط بالحروف

# Format_LettersOnlyWithField
source: {0} can only contain letters
ar: {0} يمكن أن يحتوي على حروف فقط

# Format_NumbersOnly
source: Only numbers are allowed
ar: يُسمح فقط بالأرقام

# Format_NumbersOnlyWithField
source: {0} can only contain numbers
ar: {0} يمكن أن يحتوي على أرقام فقط

# Format_NoSpecialChars
source: Special characters are not allowed
ar: الرموز الخاصة غير مسموح بها

# Format_NoSpecialCharsWithField
source: {0} cannot contain special characters
ar: {0} لا يمكن أن يحتوي على رموز خاصة

# Format_StrongPassword
source: Password must contain at least one uppercase letter, one lowercase letter, one number, and one special character
ar: كلمة المرور يجب أن تحتوي على حرف كبير وحرف صغير ورقم ورمز خاص على الأقل

# Format_Username
source: Username can only contain letters, numbers, and underscores
ar: اسم المستخدم يمكن أن يحتوي على حروف وأرقام وشرطة سفلية فقط

# Length_Max
source: {0} cannot exceed {1} characters
ar: {0} لا يمكن أن يتجاوز {1} حرف

# Length_Min
source: {0} must be at least {1} characters
ar: {0} يجب أن يكون على الأقل {1} حرف

# Length_Exact
source: {0} must be exactly {1} characters
ar: {0} يجب أن يكون بالضبط {1} حرف

# Length_Range
source: {0} must be between {1} and {2} characters
ar: {0} يجب أن يكون بين {1} و {2} حرف

# Length_MaxSimple
source: Maximum {0} characters
ar: الحد الأقصى {0} حرف

# Length_MinSimple
source: Minimum {0} characters
ar: الحد الأدنى {0} حرف

# Length_TooShort
source: {0} is too short
ar: {0} قصير جداً

# Length_TooLong
source: {0} is too long
ar: {0} طويل جداً

# Range_Number
source: {0} must be between {1} and {2}
ar: {0} يجب أن يكون بين {1} و {2}

# Range_Date
source: {0} must be between {1} and {2}
ar: {0} يجب أن يكون بين {1} و {2}

# Range_Min
source: {0} must be at least {1}
ar: {0} يجب أن يكون على الأقل {1}

# Range_Max
source: {0} must not exceed {1}
ar: {0} يجب ألا يتجاوز {1}

# Range_Positive
source: {0} must be a positive number
ar: {0} يجب أن يكون رقماً موجباً

# Range_Negative
source: {0} must be a negative number
ar: {0} يجب أن يكون رقماً سالباً

# Range_NonZero
source: {0} cannot be zero
ar: {0} لا يمكن أن يكون صفراً

# Range_Future
source: {0} must be a future date
ar: {0} يجب أن يكون تاريخاً في المستقبل

# Range_Past
source: {0} must be a past date
ar: {0} يجب أن يكون تاريخاً في الماضي

# Range_TodayOrFuture
source: {0} must be today or a future date
ar: {0} يجب أن يكون اليوم أو تاريخاً في المستقبل

# Range_TodayOrPast
source: {0} must be today or a past date
ar: {0} يجب أن يكون اليوم أو تاريخاً في الماضي

# Range_NotFuture
source: {0} cannot be a future date
ar: {0} لا يمكن أن يكون تاريخاً في المستقبل

# Range_NotPast
source: {0} cannot be a past date
ar: {0} لا يمكن أن يكون تاريخاً في الماضي

# Range_Age
source: You must be at least {0} years old
ar: يجب أن يكون عمرك {0} سنة على الأقل

# Compare_Match
source: {0} and {1} do not match
ar: {0} و {1} غير متطابقين

# Compare_PasswordMatch
source: Passwords do not match
ar: كلمة المرور غير متطابقة

# Compare_EmailMatch
source: Email addresses do not match
ar: البريد الإلكتروني غير متطابق

# Compare_GreaterThan
source: {0} must be greater than {1}
ar: {0} يجب أن يكون أكبر من {1}

# Compare_GreaterThanOrEqual
source: {0} must be greater than or equal to {1}
ar: {0} يجب أن يكون أكبر من أو يساوي {1}

# Compare_LessThan
source: {0} must be less than {1}
ar: {0} يجب أن يكون أصغر من {1}

# Compare_LessThanOrEqual
source: {0} must be less than or equal to {1}
ar: {0} يجب أن يكون أصغر من أو يساوي {1}

# Compare_Equal
source: {0} must be equal to {1}
ar: {0} يجب أن يكون مساوياً لـ {1}

# Compare_NotEqual
source: {0} must not be equal to {1}
ar: {0} يجب ألا يكون مساوياً لـ {1}

# Compare_StartEndDate
source: End date must be after start date
ar: تاريخ النهاية يجب أن يكون بعد تاريخ البداية

# Compare_MinMax
source: Maximum value must be greater than minimum value
ar: القيمة القصوى يجب أن تكون أكبر من القيمة الدنيا

# Compare_CurrentNewPassword
source: New password must be different from current password
ar: كلمة المرور الجديدة يجب أن تختلف عن كلمة المرور الحالية

# File_Required
source: Please select a file to upload
ar: يرجى اختيار ملف للرفع

# File_Size
source: File size cannot exceed {0} MB
ar: حجم الملف لا يمكن أن يتجاوز {0} ميجابايت

# File_SizeExceeded
source: The selected file exceeds the maximum allowed size of {0} MB
ar: الملف المحدد يتجاوز الحد الأقصى المسموح به وهو {0} ميجابايت

# File_Type
source: Only {0} files are allowed
ar: يُسمح فقط بملفات {0}

# File_TypeInvalid
source: Invalid file type. Allowed types: {0}
ar: نوع الملف غير صالح. الأنواع المسموح بها: {0}

# File_Image
source: Please select a valid image file (jpg, png, gif, etc)
ar: يرجى اختيار ملف صورة صالح (jpg, png, gif, إلخ)

# File_Document
source: Please select a valid document (pdf, doc, docx, etc)
ar: يرجى اختيار مستند صالح (pdf, doc, docx, إلخ)

# File_ImageDimensions
source: Image dimensions must be between {0}x{1} and {2}x{3} pixels
ar: أبعاد الصورة يجب أن تكون بين {0}x{1} و {2}x{3} بكسل

# File_ImageMinDimensions
source: Image must be at least {0}x{1} pixels
ar: الصورة يجب أن تكون على الأقل {0}x{1} بكسل

# File_ImageMaxDimensions
source: Image must not exceed {0}x{1} pixels
ar: الصورة يجب ألا تتجاوز {0}x{1} بكسل

# File_ImageRatio
source: Image must have aspect ratio {0}:{1}
ar: الصورة يجب أن تكون بنسبة عرض إلى ارتفاع {0}:{1}

# File_ImageSquare
source: Image must be square (width equals height)
ar: الصورة يجب أن تكون مربعة (العرض يساوي الارتفاع)

# File_Count
source: You can upload up to {0} files
ar: يمكنك رفع حتى {0} ملف

# File_CountExceeded
source: You cannot upload more than {0} files
ar: لا يمكنك رفع أكثر من {0} ملف

# File_Empty
source: The selected file is empty
ar: الملف المحدد فارغ

# File_Corrupted
source: The file appears to be corrupted
ar: يبدو أن الملف تالف

# Custom_Unique
source: {0} already exists
ar: {0} موجود بالفعل

# Custom_UniqueEmail
source: This email is already registered
ar: البريد الإلكتروني مسجل بالفعل

# Custom_UniqueUsername
source: This username is already taken
ar: اسم المستخدم مستخدم بالفعل

# Custom_UniquePhone
source: This phone number is already registered
ar: رقم الهاتف مسجل بالفعل

# Custom_Exists
source: The selected {0} does not exist
ar: العنصر المحدد {0} غير موجود

# Custom_InsufficientStock
source: Insufficient stock for {0}. Available: {1}
ar: الكمية غير كافية لـ {0}. المتاح: {1}

# Custom_InsufficientBalance
source: Insufficient balance. Your balance: {0}
ar: الرصيد غير كافٍ. رصيدك: {0}

# Custom_LimitExceeded
source: {0} exceeds the allowed limit of {1}
ar: {0} يتجاوز الحد المسموح به وهو {1}

# Custom_NotAllowed
source: {0} is not allowed
ar: {0} غير مسموح به

# Custom_InvalidOperation
source: This operation cannot be performed on a {0} with status {1}
ar: لا يمكن تنفيذ هذه العملية على {0} بحالة {1}

# Custom_DuplicateOrder
source: You already have an active order for this item
ar: لديك بالفعل طلب نشط لهذا العنصر

# Custom_MaxOrders
source: You cannot place more than {0} orders per day
ar: لا يمكنك تقديم أكثر من {0} طلب في اليوم

# Custom_BookingConflict
source: The selected time slot is already booked
ar: الوقت المحدد محجوز بالفعل

# Custom_MinimumOrder
source: Minimum order amount is {0}
ar: الحد الأدنى للطلب هو {0}

# Custom_MaximumOrder
source: Maximum order amount is {0}
ar: الحد الأقصى للطلب هو {0}

# Custom_ShippingRestriction
source: Shipping is not available to the selected location
ar: الشحن غير متاح للموقع المحدد

# Custom_PaymentFailed
source: Payment processing failed. Please try again
ar: فشلت معالجة الدفع. يرجى المحاولة مرة أخرى

# Custom_CouponInvalid
source: Invalid coupon code
ar: رمز الكوبون غير صالح

# Custom_CouponExpired
source: This coupon has expired
ar: هذا الكوبون منتهي الصلاحية

# Custom_CouponUsed
source: This coupon has already been used
ar: هذا الكوبون مستخدم بالفعل

# Custom_CouponMinOrder
source: This coupon requires a minimum order of {0}
ar: هذا الكوبون يتطلب حداً أدنى للطلب بقيمة {0}

# Auth_InvalidCredentials
source: Invalid email or password
ar: البريد الإلكتروني أو كلمة المرور غير صحيحة

# Auth_AccountLocked
source: Your account has been locked. Please try again after {0} minutes
ar: تم قفل حسابك. يرجى المحاولة مرة أخرى بعد {0} دقيقة

# Auth_AccountNotActive
source: Your account is not active. Please contact support
ar: حسابك غير نشط. يرجى التواصل مع الدعم

# Auth_EmailNotVerified
source: Please verify your email address before logging in
ar: يرجى تأكيد بريدك الإلكتروني قبل تسجيل الدخول

# Auth_PhoneNotVerified
source: Please verify your phone number before continuing
ar: يرجى تأكيد رقم هاتفك قبل المتابعة

# Auth_TokenExpired
source: Your session has expired. Please log in again
ar: انتهت صلاحية الجلسة. يرجى تسجيل الدخول مرة أخرى

# Auth_TokenInvalid
source: Invalid authentication token
ar: رمز المصادقة غير صالح

# Auth_Unauthorized
source: You are not authorized to perform this action
ar: ليس لديك صلاحية لتنفيذ هذا الإجراء

# Auth_AccessDenied
source: Access denied. You do not have the required permissions
ar: تم رفض الوصول. لا تملك الصلاحيات المطلوبة

# Auth_LoginRequired
source: You must be logged in to access this page
ar: يجب تسجيل الدخول للوصول إلى هذه الصفحة

# Auth_TooManyAttempts
source: Too many failed attempts. Please try again after {0} minutes
ar: محاولات فاشلة كثيرة. يرجى المحاولة مرة أخرى بعد {0} دقيقة

# Auth_PasswordResetRequired
source: You must reset your password before continuing
ar: يجب إعادة تعيين كلمة المرور قبل المتابعة

# Auth_OldPasswordIncorrect
source: Current password is incorrect
ar: كلمة المرور الحالية غير صحيحة

# Auth_NewPasswordSame
source: New password must be different from current password
ar: كلمة المرور الجديدة يجب أن تختلف عن كلمة المرور الحالية

# Auth_TwoFactorRequired
source: Two-factor authentication code is required
ar: رمز التحقق بخطوتين مطلوب

# Auth_TwoFactorInvalid
source: Invalid two-factor authentication code
ar: رمز التحقق بخطوتين غير صالح

# Val_Invalid
source: {0} is invalid
ar: {0} غير صالح

# Val_InvalidInput
source: Invalid input
ar: إدخال غير صالح

# Val_InvalidFormat
source: Invalid format
ar: تنسيق غير صالح

# Val_InvalidValue
source: Invalid value
ar: قيمة غير صالحة

# Val_InvalidSelection
source: Invalid selection
ar: اختيار غير صالح

# Val_MustMatch
source: {0} must match {1}
ar: {0} يجب أن يطابق {1}

# Val_AlreadyExists
source: {0} already exists
ar: {0} موجود بالفعل

# Val_NotFound
source: {0} not found
ar: {0} غير موجود

# Val_CannotBeEmpty
source: {0} cannot be empty
ar: {0} لا يمكن أن يكون فارغاً

# Val_CannotBeNull
source: {0} cannot be null
ar: {0} لا يمكن أن يكون فارغاً

# Val_CannotBeZero
source: {0} cannot be zero
ar: {0} لا يمكن أن يكون صفراً

# Val_CannotBeNegative
source: {0} cannot be negative
ar: {0} لا يمكن أن يكون سالباً

# Val_OutOfRange
source: {0} is out of range
ar: {0} خارج النطاق المسموح به
